FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ns_ДляБизнеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ДляБизнеса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionДляБизнеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoodsType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_GoodsType_ДляБизнеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/ns_ДляБизнесаВалидация/Ext/Module.bsl
Функция ПолучитьОбязательныеПоля() Экспорт
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Category");
	ОбязательныеПоля.Добавить("Title");
	ОбязательныеПоля.Добавить("GoodsType");
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьОбязательныеПоляШаблона() Экспорт
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Address");
	ОбязательныеПоля.Добавить("Category");
	ОбязательныеПоля.Добавить("Description");
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьДополнительныеОбязательныеПоля(Category) Экспорт
	ОбязательныеПоля = Новый Массив;
	Если Category = ns_ДляБизнесаПовтИсп.ПолучитьОборудованиеДляБизнеса() Тогда
		ОбязательныеПоля.Добавить("Condition");
	КонецЕсли; 
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция СнятьБезОстатковСВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ДляБизнеса.Ссылка КАК Ссылка,
	|	ns_ДляБизнеса.Номенклатура КАК Номенклатура,
	|	ns_ДляБизнеса.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ns_ДляБизнеса КАК ns_ДляБизнеса
	|ГДЕ
	|	ns_ДляБизнеса.Выгружать = ИСТИНА";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	Номенклатура = Выгрузка.ВыгрузитьКолонку("Номенклатура");
	Остатки = ns_Переопределяемый.ПолучитьТаблицуОстатков(Номенклатура);
	
	Для каждого Стр Из Выгрузка Цикл
		Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
			Идентификатор = Строка(Стр.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Стр.Характеристика.УникальныйИдентификатор());
		Иначе
			Идентификатор = Строка(Стр.Номенклатура.УникальныйИдентификатор());
		КонецЕсли; 
		
		Если Остатки[Идентификатор] = Неопределено Тогда
			СпрОбъект = Стр.Ссылка.ПолучитьОбъект();
			СпрОбъект.Выгружать = Ложь;
			СпрОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции

Функция ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки = Неопределено) Экспорт
	ЕстьОшибка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Данные.Category) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле Category", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Данные.GoodsType) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле GoodsType", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Данные.Title) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле Title", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;

	Если Картинки = Неопределено Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	Иначе
		КартинкиТовара = Картинки[Данные.Ссылка];
		Если КартинкиТовара = Неопределено Тогда
			ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
			ЕстьОшибка = Истина; 
		ИначеЕсли КартинкиТовара.Количество() = 0 Тогда	
			ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
			ЕстьОшибка = Истина; 
		КонецЕсли;
	КонецЕсли;	
	
	ДопПоля = ПолучитьДополнительныеОбязательныеПоля(Данные.Category);
	Для каждого ТекПоле Из ДопПоля Цикл
		Если НЕ ЗначениеЗаполнено(Данные[ТекПоле]) Тогда
			ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле " + ТекПоле, Данные, ТаблицаОшибок);
			ЕстьОшибка = Истина;
		КонецЕсли;
	КонецЦикла;        
	
	Возврат ЕстьОшибка;
КонецФункции
